A = [1, 0; 
     0, 0];
b = [2; 
     4];
d = [2;
     4];

t_n = 0.9;
t_n_star = 4.7;
w0 = t_n_star / t_n;

% желаемая матрица
A_zh = [0,    1; 
        -w0^2, -2*w0];

H = [1, 0];
C = b * H;

M = sylvester(A, -A_zh, C);

% обратная связь
K = H * inv(M);

% вывод матриц
fprintf('Рассчитанное значение w0 = %.4f\n\n', w0);
disp('Желаемая матрица A_ж (A_zh):');
disp(A_zh);
fprintf('\n');
disp('Результирующая матрица M:');
disp(M);
fprintf('\n');
disp('Искомый вектор обратной связи K:');
disp(K);

A0f = [0    1;
       0.25 1];
b0f = [0; 1];
Q = eye(2);
N = b0f/d;